org-posts/2019-04-07-media-types.md.org
#+TITLE: Why learn... about Media Types

#+DATE: [2019-04-07]

Media types are used to communicate the type of data being sent over the
web. They are used

- in an HTTP response to declare the type of content being sent
- in requests to declare what sort of content the client can interpret
- in POST requests to declare the type of content being sent.

Basically, wherever there is data on the web, there will be a media type
to tell you what sort of data it is. And if there's not, well there
really ought to be.

This article will explain how to interpret a media type and also explain
how they are used in HTTP headers to make sure we get the data that we
can understand.

- [[#who-is-this-for][Who is this for?]]
- [[#where-have-i-seen-media-types-before][Where Have I seen Media Types
  Before?]]
- [[#media-type-syntax][Media Type Syntax]]
- [[#media-types-in-http-message-headers][Media Types in HTTP Message
  Headers]]
- [[#content-negotiation][Content Negotiation]]
- [[#roll-your-own-media-type][Roll Your Own Media Type]]
- [[#summary][Summary]]
- [[#q-and-a][Q and A]]

** Who is this for?
   :PROPERTIES:
   :CUSTOM_ID: who-is-this-for
   :END:

This is for web developers who are interested in understanding how to
move data over the web. Some knowledge of HTTP, specifically headers, is
useful but not necessary.

** Where Have I Seen Media Types Before?
   :PROPERTIES:
   :CUSTOM_ID: where-have-i-seen-media-types-before
   :END:

The first time I saw a media type was when I wrote my first HTML file -
specifically to get some CSS:[fn:1]

#+BEGIN_EXAMPLE
  <link rel="stylesheet" src="style.css" type="text/css" />
#+END_EXAMPLE

There's our first media type - =text/css=.

The next place I bumped into them was when I was returning JSON from a
server:

#+BEGIN_EXAMPLE
  response.contentType = "application/json"
#+END_EXAMPLE

There's another one - =application/json=.

So they're not completely alien to us - they're a way of saying that
"the file is full of CSS", and "I'm sending you some JSON". Let's take a
closer look at these two types while investigating the syntax of media
types.

** Media Type Syntax
   :PROPERTIES:
   :CUSTOM_ID: media-type-syntax
   :END:

A media type is made up of two fields separated by a =/=. The first is
the =type= and the second is the =subtype=.

Straight off we can see that CSS (=text/css=) has a type of =text=, and
a subtype of =css=. The =text= type is very broad - it says that the
media is just text, which covers quite a few types of content - content
such as:

- =text/html= - it's what you're reading right now!
- =text/plain= - it's just plain text!
- =text/markdown= - what I'm writing this in which will get turned into
  =text/html=
- =text/csv= ...

you get the idea.

=application/json= has a subtype of =json=, which is appropriate as,
well, it /is/ JSON. The =application= type informs us that this is a
type that's meant to be processed by a application. This kinda makes
sense, as it's JSON, which is meant to be read by computers.

(But isn't CSS only meant to be processed by an application? Yes, it is.
Maybe it should have been =application/css=. Maybe it should have been
=text/json=. Who knows. Media types are a bit wonky. The whole web is a
bit wonky. Don't worry about it too much. Part of being a web developer
is learning to live with a fair amount of kludge and ambiguity that
happened before some of us were born. Learn to live with it.)

Other fun =application= types are

- =application/pdf= for PDFs
- =application/zip= for zip files
- and many, many more...

*** All the types
    :PROPERTIES:
    :CUSTOM_ID: all-the-types
    :END:

We've seen =text= and =application= types - here's a list of types that
you're likely to come across with examples:

| type          | purpose                              | example               |
|---------------+--------------------------------------+-----------------------|
| =application= | media for application consumption    | =application/json=    |
| =audio=       | audio media                          | =audio/mp3=           |
| =font=        | font formats                         | =font/ttf=            |
| =image=       | visual media                         | =image/gif=           |
| =multipart=   | media that needs to be sent in parts | =multipart/form-data= |
| =text=        | plain text                           | =text/html=           |
| =video=       | video media                          | =video/mp4=           |

Type and subtype are the only parts of a media type that are required,
but there are also couple of optional parts.

*** Parameters
    :PROPERTIES:
    :CUSTOM_ID: parameters
    :END:

Media types can have a list of parameters tagged on to them after a
semicolon. For instance

#+BEGIN_EXAMPLE
  text/plain;charset=UTF-8
#+END_EXAMPLE

is a =text/plain= media type that's using the UTF-8 character encoding.
If we want our sweet emojis to work we need to remember to say we're
using UTF-8, or else the client will assume we're writing in ASCII like
1970s cavemen.

Parameter types aren't dictated by the media type specification,[fn:2]
and you can have as many of them as you like:

#+BEGIN_EXAMPLE
  text/plain;charset=UTF-8,blog-post=true,author=gypsydave5
#+END_EXAMPLE

They gain their meaning through context; browsers, for instance, will
look for and use a =charset= parameter when they read a media type over
HTTP. More on browsers in a bit.

