org-out/2019-04-07-media-types.md.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="rss.xml"
      title="RSS feed for "/>
<title>Why learn... about Media Types</title>
<meta name="author" content="John Dow">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
  <a href="https://staticblog.org">My Static Org Blog</a>
</div></div>
<div id="content">
<div class="post-date">16 Sep 2020</div><h1 class="post-title"><a href="/2019-04-07-media-types.md.html">Why learn... about Media Types</a></h1>
<p>
Media types are used to communicate the type of data being sent over the
web. They are used
</p>

<ul class="org-ul">
<li>in an HTTP response to declare the type of content being sent</li>
<li>in requests to declare what sort of content the client can interpret</li>
<li>in POST requests to declare the type of content being sent.</li>
</ul>

<p>
Basically, wherever there is data on the web, there will be a media type
to tell you what sort of data it is. And if there's not, well there
really ought to be.
</p>

<p>
This article will explain how to interpret a media type and also explain
how they are used in HTTP headers to make sure we get the data that we
can understand.
</p>

<ul class="org-ul">
<li><a href="#who-is-this-for">Who is this for?</a></li>
<li><a href="#where-have-i-seen-media-types-before">Where Have I seen Media Types
Before?</a></li>
<li><a href="#media-type-syntax">Media Type Syntax</a></li>
<li><a href="#media-types-in-http-message-headers">Media Types in HTTP Message
Headers</a></li>
<li><a href="#content-negotiation">Content Negotiation</a></li>
<li><a href="#roll-your-own-media-type">Roll Your Own Media Type</a></li>
<li><a href="#summary">Summary</a></li>
<li><a href="#q-and-a">Q and A</a></li>
</ul>

<div id="outline-container-orgfaad7e7" class="outline-2">
<h2 id="who-is-this-for">Who is this for?</h2>
<div class="outline-text-2" id="text-who-is-this-for">
<p>
This is for web developers who are interested in understanding how to
move data over the web. Some knowledge of HTTP, specifically headers, is
useful but not necessary.
</p>
</div>
</div>

<div id="outline-container-org5a745a7" class="outline-2">
<h2 id="where-have-i-seen-media-types-before">Where Have I Seen Media Types Before?</h2>
<div class="outline-text-2" id="text-where-have-i-seen-media-types-before">
<p>
The first time I saw a media type was when I wrote my first HTML file -
specifically to get some CSS:<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<pre class="example">
&lt;link rel="stylesheet" src="style.css" type="text/css" /&gt;
</pre>

<p>
There's our first media type - <code>text/css</code>.
</p>

<p>
The next place I bumped into them was when I was returning JSON from a
server:
</p>

<pre class="example">
response.contentType = "application/json"
</pre>

<p>
There's another one - <code>application/json</code>.
</p>

<p>
So they're not completely alien to us - they're a way of saying that
"the file is full of CSS", and "I'm sending you some JSON". Let's take a
closer look at these two types while investigating the syntax of media
types.
</p>
</div>
</div>

<div id="outline-container-orgc20ae24" class="outline-2">
<h2 id="media-type-syntax">Media Type Syntax</h2>
<div class="outline-text-2" id="text-media-type-syntax">
<p>
A media type is made up of two fields separated by a <code>/</code>. The first is
the <code>type</code> and the second is the <code>subtype</code>.
</p>

<p>
Straight off we can see that CSS (<code>text/css</code>) has a type of <code>text</code>, and
a subtype of <code>css</code>. The <code>text</code> type is very broad - it says that the
media is just text, which covers quite a few types of content - content
such as:
</p>

<ul class="org-ul">
<li><code>text/html</code> - it's what you're reading right now!</li>
<li><code>text/plain</code> - it's just plain text!</li>
<li><code>text/markdown</code> - what I'm writing this in which will get turned into
<code>text/html</code></li>
<li><code>text/csv</code> &#x2026;</li>
</ul>

<p>
you get the idea.
</p>

<p>
<code>application/json</code> has a subtype of <code>json</code>, which is appropriate as,
well, it <i>is</i> JSON. The <code>application</code> type informs us that this is a
type that's meant to be processed by a application. This kinda makes
sense, as it's JSON, which is meant to be read by computers.
</p>

<p>
(But isn't CSS only meant to be processed by an application? Yes, it is.
Maybe it should have been <code>application/css</code>. Maybe it should have been
<code>text/json</code>. Who knows. Media types are a bit wonky. The whole web is a
bit wonky. Don't worry about it too much. Part of being a web developer
is learning to live with a fair amount of kludge and ambiguity that
happened before some of us were born. Learn to live with it.)
</p>

<p>
Other fun <code>application</code> types are
</p>

<ul class="org-ul">
<li><code>application/pdf</code> for PDFs</li>
<li><code>application/zip</code> for zip files</li>
<li>and many, many more&#x2026;</li>
</ul>
</div>

<div id="outline-container-orge96b886" class="outline-3">
<h3 id="all-the-types">All the types</h3>
<div class="outline-text-3" id="text-all-the-types">
<p>
We've seen <code>text</code> and <code>application</code> types - here's a list of types that
you're likely to come across with examples:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-left">purpose</th>
<th scope="col" class="org-left">example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>application</code></td>
<td class="org-left">media for application consumption</td>
<td class="org-left"><code>application/json</code></td>
</tr>

<tr>
<td class="org-left"><code>audio</code></td>
<td class="org-left">audio media</td>
<td class="org-left"><code>audio/mp3</code></td>
</tr>

<tr>
<td class="org-left"><code>font</code></td>
<td class="org-left">font formats</td>
<td class="org-left"><code>font/ttf</code></td>
</tr>

<tr>
<td class="org-left"><code>image</code></td>
<td class="org-left">visual media</td>
<td class="org-left"><code>image/gif</code></td>
</tr>

<tr>
<td class="org-left"><code>multipart</code></td>
<td class="org-left">media that needs to be sent in parts</td>
<td class="org-left"><code>multipart/form-data</code></td>
</tr>

<tr>
<td class="org-left"><code>text</code></td>
<td class="org-left">plain text</td>
<td class="org-left"><code>text/html</code></td>
</tr>

<tr>
<td class="org-left"><code>video</code></td>
<td class="org-left">video media</td>
<td class="org-left"><code>video/mp4</code></td>
</tr>
</tbody>
</table>

<p>
Type and subtype are the only parts of a media type that are required,
but there are also couple of optional parts.
</p>
</div>
</div>

<div id="outline-container-org5b892cb" class="outline-3">
<h3 id="parameters">Parameters</h3>
<div class="outline-text-3" id="text-parameters">
<p>
Media types can have a list of parameters tagged on to them after a
semicolon. For instance
</p>

<pre class="example">
text/plain;charset=UTF-8
</pre>

<p>
is a <code>text/plain</code> media type that's using the UTF-8 character encoding.
If we want our sweet emojis to work we need to remember to say we're
using UTF-8, or else the client will assume we're writing in ASCII like
1970s cavemen.
</p>

<p>
Parameter types aren't dictated by the media type specification,<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
and you can have as many of them as you like:
</p>

<pre class="example">
text/plain;charset=UTF-8,blog-post=true,author=gypsydave5
</pre>

<p>
They gain their meaning through context; browsers, for instance, will
look for and use a <code>charset</code> parameter when they read a media type over
HTTP. More on browsers in a bit.
</p>
</div>
</div>
