org-posts/2019-04-07-media-types.md.org
*** Structured Syntax Name Suffix
    :PROPERTIES:
    :CUSTOM_ID: structured-syntax-name-suffix
    :END:

This one's a bit weird, but it's also cool, so bear with me. Take a look
at this media type:

#+BEGIN_EXAMPLE
  image/svg+xml
#+END_EXAMPLE

This is the type for SVG images - Scalable Vector Graphics. =image= is
the type, =svg= is the subtype - that's what we'd expect.

But what's this =+xml= doing at the end? Well, as you may already know,
SVGs are written in XML - it's one of the nicest things about them. So
the =+xml= is telling us that the syntax of SVG is XML; you could say
that XML is the 'base' language for SVG. This is called the 'structured
syntax name', and it's a nice way of letting us know that, hey, you may
not know what SVGs are but, it's OK, it's just XML under the hood so
you'll be fine.

(Unless you're me and you panic everytime you hear the word XML and you
find it ridiculous that some people think it's human readable and you
wish that the whole world was represented as JSON, but that's another
story...)

--------------

Look, I can tell you're really excited by all these media types. Now you
know how to understand them, you can read the
[[https://www.iana.org/assignments/media-types/media-types.xhtml][list
of all the media types]] that have been registered with IANA, the
Internet Assigned Numbers Authority. Go on, read them all now. I'll
wait.

There's a lot, right? Try not to panic - you'll probably only ever use
ten of them at most. But did you see the one for SNES ROMs?

** Media Types in HTTP Message Headers
   :PROPERTIES:
   :CUSTOM_ID: media-types-in-http-message-headers
   :END:

The most important place you'll use media types is in HTTP messages.
You'll use them to describe the media type of the data you want in the
=Accept= header of an HTTP Request, and the type of data you're sending
in the =Content-Type= header of an HTTP Response.

*** The =Accept= Header
    :PROPERTIES:
    :CUSTOM_ID: the-accept-header
    :END:

The =Accept= header is the way a client - like your browser - can tell a
server what sort of content it wants.

At its simplest it can look like this:

#+BEGIN_EXAMPLE
  Accept: application/json
#+END_EXAMPLE

If I put this in the header of my request, I'd be making it very clear
to the server that I want JSON back. No questions asked.[fn:3]

But say you wanted some audio back from the server, but didn't mind what
subtype - =audio/mp3= is just as good as =audio/wav= for you. In this
case you can say:

#+BEGIN_EXAMPLE
  Accept: audio/*
#+END_EXAMPLE

=*= represents a wildcard - it means 'give me anything'. The server
could legitimately reply with an =audio= media type with /any/ subtype.

Finally, if you just don't care what comes back from the server you can
just say

#+BEGIN_EXAMPLE
  Accept: */*
#+END_EXAMPLE

*** The =Content-Type= Header
    :PROPERTIES:
    :CUSTOM_ID: the-content-type-header
    :END:

=Content-Type= is the header you should add to an HTTP Response message
to tell the client what they're getting in the response body. This is
how the client knows how to interpret the message that you're sending.

The =Content-Type= header should have one media type, so it could be as
simple as this:

#+BEGIN_EXAMPLE
  Content-Type: text/html
#+END_EXAMPLE

*** Wait, can't I just use a file extension?
    :PROPERTIES:
    :CUSTOM_ID: wait-cant-i-just-use-a-file-extension
    :END:

You can imagine that you've got some data that you can get to through a
URL:

#+BEGIN_EXAMPLE
  http://gypsydave5/data
#+END_EXAMPLE

Maybe if I wanted to get the data as JSON I could request:

#+BEGIN_EXAMPLE
  http://gypsydave5/data.json
#+END_EXAMPLE

But if I want XML instead I could do:

#+BEGIN_EXAMPLE
  http://gypsydave5/data.xml
#+END_EXAMPLE

The benefit being that this is pretty easy to understand if I'm used to
using a filesystem - I can just identify the type of file by the
extension, and so I can now do the same with a URL.

What's the harm? Probably the most annoying thing is that, even if you
provide an extension as above, you'll /still/ have to provide a
=Content-Type= header. This is because, on the web, information about
content isn't meant to be encoded in URLs; it's meant to be in the
=Content-Type= header.

Some popular frameworks do this,[fn:4] but it's a bad idea. Don't do it.

The biggest problem is that you'll miss out on being able to perform
/content negotiation/.

