org-out/2019-04-07-media-types.md.html

<div id="outline-container-org2a9c67c" class="outline-3">
<h3 id="structured-syntax-name-suffix">Structured Syntax Name Suffix</h3>
<div class="outline-text-3" id="text-structured-syntax-name-suffix">
<p>
This one's a bit weird, but it's also cool, so bear with me. Take a look
at this media type:
</p>

<pre class="example">
image/svg+xml
</pre>

<p>
This is the type for SVG images - Scalable Vector Graphics. <code>image</code> is
the type, <code>svg</code> is the subtype - that's what we'd expect.
</p>

<p>
But what's this <code>+xml</code> doing at the end? Well, as you may already know,
SVGs are written in XML - it's one of the nicest things about them. So
the <code>+xml</code> is telling us that the syntax of SVG is XML; you could say
that XML is the 'base' language for SVG. This is called the 'structured
syntax name', and it's a nice way of letting us know that, hey, you may
not know what SVGs are but, it's OK, it's just XML under the hood so
you'll be fine.
</p>

<p>
(Unless you're me and you panic everytime you hear the word XML and you
find it ridiculous that some people think it's human readable and you
wish that the whole world was represented as JSON, but that's another
story&#x2026;)
</p>

<hr>

<p>
Look, I can tell you're really excited by all these media types. Now you
know how to understand them, you can read the
<a href="https://www.iana.org/assignments/media-types/media-types.xhtml">list
of all the media types</a> that have been registered with IANA, the
Internet Assigned Numbers Authority. Go on, read them all now. I'll
wait.
</p>

<p>
There's a lot, right? Try not to panic - you'll probably only ever use
ten of them at most. But did you see the one for SNES ROMs?
</p>
</div>
</div>
</div>

<div id="outline-container-org883213b" class="outline-2">
<h2 id="media-types-in-http-message-headers">Media Types in HTTP Message Headers</h2>
<div class="outline-text-2" id="text-media-types-in-http-message-headers">
<p>
The most important place you'll use media types is in HTTP messages.
You'll use them to describe the media type of the data you want in the
<code>Accept</code> header of an HTTP Request, and the type of data you're sending
in the <code>Content-Type</code> header of an HTTP Response.
</p>
</div>

<div id="outline-container-org01d32cf" class="outline-3">
<h3 id="the-accept-header">The <code>Accept</code> Header</h3>
<div class="outline-text-3" id="text-the-accept-header">
<p>
The <code>Accept</code> header is the way a client - like your browser - can tell a
server what sort of content it wants.
</p>

<p>
At its simplest it can look like this:
</p>

<pre class="example">
Accept: application/json
</pre>

<p>
If I put this in the header of my request, I'd be making it very clear
to the server that I want JSON back. No questions asked.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
But say you wanted some audio back from the server, but didn't mind what
subtype - <code>audio/mp3</code> is just as good as <code>audio/wav</code> for you. In this
case you can say:
</p>

<pre class="example">
Accept: audio/*
</pre>

<p>
<code>*</code> represents a wildcard - it means 'give me anything'. The server
could legitimately reply with an <code>audio</code> media type with <i>any</i> subtype.
</p>

<p>
Finally, if you just don't care what comes back from the server you can
just say
</p>

<pre class="example">
Accept: */*
</pre>
</div>
</div>

<div id="outline-container-orga7894ff" class="outline-3">
<h3 id="the-content-type-header">The <code>Content-Type</code> Header</h3>
<div class="outline-text-3" id="text-the-content-type-header">
<p>
<code>Content-Type</code> is the header you should add to an HTTP Response message
to tell the client what they're getting in the response body. This is
how the client knows how to interpret the message that you're sending.
</p>

<p>
The <code>Content-Type</code> header should have one media type, so it could be as
simple as this:
</p>

<pre class="example">
Content-Type: text/html
</pre>
</div>
</div>

<div id="outline-container-org8f02549" class="outline-3">
<h3 id="wait-cant-i-just-use-a-file-extension">Wait, can't I just use a file extension?</h3>
<div class="outline-text-3" id="text-wait-cant-i-just-use-a-file-extension">
<p>
You can imagine that you've got some data that you can get to through a
URL:
</p>

<pre class="example">
http://gypsydave5/data
</pre>

<p>
Maybe if I wanted to get the data as JSON I could request:
</p>

<pre class="example">
http://gypsydave5/data.json
</pre>

<p>
But if I want XML instead I could do:
</p>

<pre class="example">
http://gypsydave5/data.xml
</pre>

<p>
The benefit being that this is pretty easy to understand if I'm used to
using a filesystem - I can just identify the type of file by the
extension, and so I can now do the same with a URL.
</p>

<p>
What's the harm? Probably the most annoying thing is that, even if you
provide an extension as above, you'll <i>still</i> have to provide a
<code>Content-Type</code> header. This is because, on the web, information about
content isn't meant to be encoded in URLs; it's meant to be in the
<code>Content-Type</code> header.
</p>

<p>
Some popular frameworks do this,<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> but it's a bad idea. Don't do it.
</p>

<p>
The biggest problem is that you'll miss out on being able to perform
<i>content negotiation</i>.
</p>
</div>
</div>
</div>
