org-posts/2019-04-07-media-types.md.org
** Content Negotiation
   :PROPERTIES:
   :CUSTOM_ID: content-negotiation
   :END:

Pretend you're going to a sandwich shop and your friend asks you to get
a sandwich. Sure, you say, what do you want? I don't know, they say,
what do they have? Um... you say, I really don't know - here's the menu
but they've often run out of some of the fillings by this time of day.

OK, says your friend, here's what I'd like:

#+BEGIN_QUOTE
  "I want tuna mayo or a New Yorker - either is fine. If they don't have
  those, then I'll take an egg salad. And if they don't have an egg
  salad, then please, get me anything - I'm starving."
#+END_QUOTE

Doesn't sound too bad. You can use your friend's set of sandwich
requirements when you get to the sandwich shop to get them a sandwich
that they'll like.

The same thing happens every day on the web, with clients sending a list
of media types over to servers to try and make sure that they'll get
something they like. Take a look at this =Accept= header of an HTTP
Request sent from a web browser:[fn:5]

#+BEGIN_EXAMPLE
  Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
#+END_EXAMPLE

The browser wants one of the above media types. But it's got some
opinions about which ones it would prefer, which it's expressing using
=q= parameters.[fn:6] =q= parameters have a value between =1= and =0=,
and the default value of a =q= parameter (when it's not supplied) is
=1=.

Here's the media types above written out with their =q= values.

| media type              | q value |
|-------------------------+---------|
| =text/html=             | 1.0     |
| =application/xhtml+xml= | 1.0     |
| =application/xml=       | 0.9     |
| =*/*=                   | 0.8     |

A series of choices ranked by preference. If you or I were going to the
server to get the browser some content, the browser would tell us
something like:

#+BEGIN_QUOTE
  "I really want =text/html= and =application/xhtml+xml=. But, if they
  don't have those, I'd go for some sweet =application/xml=. And if they
  don't have that then, whatever, just get me anything."
#+END_QUOTE

Which is really what you'd want a browser to do - you always want to get
/something/ back.

#+BEGIN_EXAMPLE
  Accept: audio/*
#+END_EXAMPLE

Is like we're being sent to the record store:

#+BEGIN_QUOTE
  "Could you get me the new Nirvana album?[fn:7] I don't care if it's on
  vinyl, tape or CD. Hell, 8 Track will do. Just make sure I can listen
  to it, OK - I don't just want the poster."
#+END_QUOTE

This is /content negotiation/ - our request to the server has given it
our preferences regarding the content type we get back. It can go
through those prefences, looking at what content types it can return,
and give us the type that matches the most closely.

*** Content Negotiation and Testing
    :PROPERTIES:
    :CUSTOM_ID: content-negotiation-and-testing
    :END:

It's easier to write tests on the data that builds an HTML page than the
HTML itself. If you build your application with content negotiation, you
can test the contents of a 'page' by requesting the JSON representation
rather than the HTML representation.

** Roll your own media type
   :PROPERTIES:
   :CUSTOM_ID: roll-your-own-media-type
   :END:

You can invent your own media types, and it's not as rare as you might
think. In fact it's a powerful technique for writing web APIs. The media
type specification has space for subtypes that aren't registered (and
should never be registered). They start with =x-=:[fn:8]

#+BEGIN_EXAMPLE
  application/x-myapplication-orderstatus+json
#+END_EXAMPLE

This could be the media type for the order status in my application.
=+json= lets everyone know that it's written in JSON, but we've tightly
specified that the content is a part of =myapplication= - it's not just
any old JSON.

This is just vanity if you don't choose to leverage it to pass on
additional information about the media type. For instance, if you want
to change the structure of the
=application/x-myapplication-orderstatus+json= media type, you can add a
version parameter:[fn:9]

#+BEGIN_EXAMPLE
  application/x-myapplication-orderstatus+json;v=1.1
#+END_EXAMPLE

This is very useful when describing the content types that are sent and
received across an evolving REST API.

Finally you can [[https://www.iana.org/form/media-types][register your
media type with IANA]] to let the world know how to interact with your
application.

** Summary
   :PROPERTIES:
   :CUSTOM_ID: summary
   :END:

We've learned:

- The syntax of a media type and what they mean.
- How to use a media type in =Content-Type= headers to declare what
  we're sending.
- How to use them in =Accept= headers to control the content type we get
  back.
- How to use them to perform content negotiation with a server.

Media types are important - they help smooth the path of passing data
around on the web. Using them - and using them well - will help make
your web applications easier for you others to use and understand.

