org-out/2019-04-07-media-types.md.html

<div id="outline-container-org2c554e6" class="outline-2">
<h2 id="content-negotiation">Content Negotiation</h2>
<div class="outline-text-2" id="text-content-negotiation">
<p>
Pretend you're going to a sandwich shop and your friend asks you to get
a sandwich. Sure, you say, what do you want? I don't know, they say,
what do they have? Um&#x2026; you say, I really don't know - here's the menu
but they've often run out of some of the fillings by this time of day.
</p>

<p>
OK, says your friend, here's what I'd like:
</p>

<blockquote>
<p>
"I want tuna mayo or a New Yorker - either is fine. If they don't have
those, then I'll take an egg salad. And if they don't have an egg
salad, then please, get me anything - I'm starving."
</p>
</blockquote>

<p>
Doesn't sound too bad. You can use your friend's set of sandwich
requirements when you get to the sandwich shop to get them a sandwich
that they'll like.
</p>

<p>
The same thing happens every day on the web, with clients sending a list
of media types over to servers to try and make sure that they'll get
something they like. Take a look at this <code>Accept</code> header of an HTTP
Request sent from a web browser:<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>
</p>

<pre class="example">
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
</pre>

<p>
The browser wants one of the above media types. But it's got some
opinions about which ones it would prefer, which it's expressing using
<code>q</code> parameters.<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup> <code>q</code> parameters have a value between <code>1</code> and <code>0</code>,
and the default value of a <code>q</code> parameter (when it's not supplied) is
<code>1</code>.
</p>

<p>
Here's the media types above written out with their <code>q</code> values.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">media type</th>
<th scope="col" class="org-right">q value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>text/html</code></td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left"><code>application/xhtml+xml</code></td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left"><code>application/xml</code></td>
<td class="org-right">0.9</td>
</tr>

<tr>
<td class="org-left"><code>*/*</code></td>
<td class="org-right">0.8</td>
</tr>
</tbody>
</table>

<p>
A series of choices ranked by preference. If you or I were going to the
server to get the browser some content, the browser would tell us
something like:
</p>

<blockquote>
<p>
"I really want <code>text/html</code> and <code>application/xhtml+xml</code>. But, if they
don't have those, I'd go for some sweet <code>application/xml</code>. And if they
don't have that then, whatever, just get me anything."
</p>
</blockquote>

<p>
Which is really what you'd want a browser to do - you always want to get
<i>something</i> back.
</p>

<pre class="example">
Accept: audio/*
</pre>

<p>
Is like we're being sent to the record store:
</p>

<blockquote>
<p>
"Could you get me the new Nirvana album?<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup> I don't care if it's on
vinyl, tape or CD. Hell, 8 Track will do. Just make sure I can listen
to it, OK - I don't just want the poster."
</p>
</blockquote>

<p>
This is <i>content negotiation</i> - our request to the server has given it
our preferences regarding the content type we get back. It can go
through those prefences, looking at what content types it can return,
and give us the type that matches the most closely.
</p>
</div>

<div id="outline-container-org0c8665f" class="outline-3">
<h3 id="content-negotiation-and-testing">Content Negotiation and Testing</h3>
<div class="outline-text-3" id="text-content-negotiation-and-testing">
<p>
It's easier to write tests on the data that builds an HTML page than the
HTML itself. If you build your application with content negotiation, you
can test the contents of a 'page' by requesting the JSON representation
rather than the HTML representation.
</p>
</div>
</div>
</div>

<div id="outline-container-org4bea9d1" class="outline-2">
<h2 id="roll-your-own-media-type">Roll your own media type</h2>
<div class="outline-text-2" id="text-roll-your-own-media-type">
<p>
You can invent your own media types, and it's not as rare as you might
think. In fact it's a powerful technique for writing web APIs. The media
type specification has space for subtypes that aren't registered (and
should never be registered). They start with <code>x-</code>:<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>
</p>

<pre class="example">
application/x-myapplication-orderstatus+json
</pre>

<p>
This could be the media type for the order status in my application.
<code>+json</code> lets everyone know that it's written in JSON, but we've tightly
specified that the content is a part of <code>myapplication</code> - it's not just
any old JSON.
</p>

<p>
This is just vanity if you don't choose to leverage it to pass on
additional information about the media type. For instance, if you want
to change the structure of the
<code>application/x-myapplication-orderstatus+json</code> media type, you can add a
version parameter:<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>
</p>

<pre class="example">
application/x-myapplication-orderstatus+json;v=1.1
</pre>

<p>
This is very useful when describing the content types that are sent and
received across an evolving REST API.
</p>

<p>
Finally you can <a href="https://www.iana.org/form/media-types">register your
media type with IANA</a> to let the world know how to interact with your
application.
</p>
</div>
</div>

<div id="outline-container-org3b97f2a" class="outline-2">
<h2 id="summary">Summary</h2>
<div class="outline-text-2" id="text-summary">
<p>
We've learned:
</p>

<ul class="org-ul">
<li>The syntax of a media type and what they mean.</li>
<li>How to use a media type in <code>Content-Type</code> headers to declare what
we're sending.</li>
<li>How to use them in <code>Accept</code> headers to control the content type we get
back.</li>
<li>How to use them to perform content negotiation with a server.</li>
</ul>

<p>
Media types are important - they help smooth the path of passing data
around on the web. Using them - and using them well - will help make
your web applications easier for you others to use and understand.
</p>
</div>
</div>
